In [2]:
import pandas as pd
import numpy as np

In [28]:
frame = pd.DataFrame(np.random.randn(4,3),
                     columns = ["b","d","e"],
                     index=["ds","if","db","tl"])
frame

           b         d         e
ds  0.741961  0.116551  1.023698
if  0.227769 -0.311478 -1.200180
db  0.782533  0.724731 -0.080575
tl  0.167723 -1.496460  0.008836

In [25]:
np.abs(frame)

           b         d         e
ds  0.255909  1.184067  1.274271
if  0.210007  2.348871  1.490671
db  0.379161  0.837528  0.113365
tl  0.239095  1.310881  0.567360

In [18]:
f = lambda x: x.max()-x.min()
frame.apply(f,axis="columns")

ds    2.405396
if    1.282959
db    0.541396
tl    0.752778
dtype: float64

In [19]:
frame.apply(f)

b    2.136510
d    3.703725
e    1.863811
dtype: float64

In [38]:
def f(x):
    return pd.Series([x.min(),x.max()], index = ["min","max"])
frame.apply(f)

            b         d         e
min  0.167723 -1.496460 -1.200180
max  0.782533  0.724731  1.023698

In [39]:
frame["e"].map(lambda x: np.abs(x))

ds    1.023698
if    1.200180
db    0.080575
tl    0.008836
Name: e, dtype: float64

In [40]:
# frame[["e","f"]].map(lambda x: np.abs(x))

In [41]:
format = lambda x: "%.2f" % x
frame.applymap(format)

       b      d      e
ds  0.74   0.12   1.02
if  0.23  -0.31  -1.20
db  0.78   0.72  -0.08
tl  0.17  -1.50   0.01

In [63]:
frame = pd.DataFrame(np.arange(8).reshape((2,4)),index=["three","one"],columns=["d","a","b","c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [64]:
frame2 = frame.sort_index()
frame2

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [65]:
frame2 = frame2.sort_index(axis="columns") # Axis = "colunms" bernilai sama dengan Axis = 1
frame2

       a  b  c  d
one    5  6  7  4
three  1  2  3  0

In [69]:
frame2_descending_Row = frame2.sort_index(ascending = False)
frame2_descending_Row

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [71]:
frame2_Descending_Row_Column = frame2_descending_Row.sort_index(axis = 1, ascending = False)
frame2_Descending_Row_Column

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [78]:
List1 = pd.Series([3,2,np.NaN,4,7,1,np.NaN])
List1.sort_values()

5    1.0
1    2.0
0    3.0
3    4.0
4    7.0
2    NaN
6    NaN
dtype: float64

In [86]:
frame = pd.DataFrame({"b":[4,7,-3,2],
                     "a":[2,1,0,5]})
frame

   b  a
0  4  2
1  7  1
2 -3  0
3  2  5

In [87]:
frame.sort_values(by="b")

   b  a
2 -3  0
3  2  5
0  4  2
1  7  1

In [89]:
frame.sort_values(by=["b","a"]) #diurutkan berdasarkan values kolom yang pertama kali di taruh ["b","a"] brrti b dulu diurutkan nnti si A ikutan urut, tapi tidak pasti akan terurut untuk nilainya

   b  a
2 -3  0
3  2  5
0  4  2
1  7  1

In [92]:
obj=pd.Series([7,-5,7,4,2,0,4]) #ranking dibagi 2 jika ada angka kembar didalm list
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [94]:
obj.rank(method="max")

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [96]:
obj.rank(method="first") #mendahulukan urutan angka yang sama dan yang pertama kali kena.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [104]:
#penggabungan DataFrame
df = pd.DataFrame(np.arange(16).reshape(4,4),columns=["a","b","c","d"])
df2 =  pd.DataFrame(np.arange(16).reshape(4,4),columns=["e","f","g","h"])

print(df)
print(df2)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
    e   f   g   h
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [103]:
pd.concat([df,df2])

      a     b     c     d     e     f     g     h
0   0.0   1.0   2.0   3.0   NaN   NaN   NaN   NaN
1   4.0   5.0   6.0   7.0   NaN   NaN   NaN   NaN
2   8.0   9.0  10.0  11.0   NaN   NaN   NaN   NaN
3  12.0  13.0  14.0  15.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN   0.0   1.0   2.0   3.0
1   NaN   NaN   NaN   NaN   4.0   5.0   6.0   7.0
2   NaN   NaN   NaN   NaN   8.0   9.0  10.0  11.0
3   NaN   NaN   NaN   NaN  12.0  13.0  14.0  15.0

In [105]:
pd.concat([df,df2], axis=1)

    a   b   c   d   e   f   g   h
0   0   1   2   3   0   1   2   3
1   4   5   6   7   4   5   6   7
2   8   9  10  11   8   9  10  11
3  12  13  14  15  12  13  14  15

In [108]:
# Gabung = df.merge(df2) -> bisa digunakan ketika nama columns sama satu sama lainnya. jika tidak maka tidak akan bisa digunakan...

Gabung = df.merge(df2, left_index=True, right_index =True)
Gabung

    a   b   c   d   e   f   g   h
0   0   1   2   3   0   1   2   3
1   4   5   6   7   4   5   6   7
2   8   9  10  11   8   9  10  11
3  12  13  14  15  12  13  14  15

In [113]:
df = pd.DataFrame([[1.4, np.NaN],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],   index = ["a","b","c","d"],
columns = ["one","two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [115]:
df.sum() #value yang bernilai NaN maka tidak akan ikut dijumlahkan(Dilewati)

one    9.25
two   -5.80
dtype: float64

In [116]:
df.sum(axis=1) #columns

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [119]:
print(df.mean(axis=1)) #Rata-Rata jika ada NaN maka akan di skip, ada anggota 3 buah, jika NaN 1 buah maka akan memiliki rumus -> a+b/2. bukan a+b+c/3

df.mean()

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

one    3.083333
two   -2.900000
dtype: float64

In [120]:
df.sum(axis=1, skipna = False) #rata-rata kolom, dan menggunakan skipna=False
# setiap kolom bernilai NaN maka akan otomatis meannya adalah NaN

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [123]:
#Menghitung Statiska Diskriptif
print(df)
df.describe()

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [124]:
df.count()

one    3
two    2
dtype: int64

In [125]:
df.diff()

   one  two
a  NaN  NaN
b  5.7  NaN
c  NaN  NaN
d  NaN  NaN

In [126]:
df.mad()

one    2.677778
two    1.600000
dtype: float64

In [127]:
df.prod()

one    7.455
two    5.850
dtype: float64